-- Додавання даних INSERT

--Таблиця авторів
INSERT INTO authors (first_name, last_name, birth_year, country)
VALUES
('Ліна', 'Костенко', 1930, 'Україна'),
('Василь', 'Стус', 1938, 'Україна'),
('Оксана', 'Забужко', 1960, 'Україна'),
('Іван', 'Франко', 1856, 'Україна'),
('Тарас', 'Шевченко', 1814, 'Україна'),
('Леся', 'Українка', 1871, 'Україна'),
('Григорій', 'Сковорода', 1722, 'Україна'),
('Юрій', 'Андрухович', 1960, 'Україна'),
('Сергій', 'Жадан', 1974, 'Україна'),
('Марко', 'Вовчок', 1833, 'Україна');

--Таблиця книг
INSERT INTO books (isbn, title, author_id, publication_year, genre, total_copies, available_copies)
VALUES
('978-617-7585-05-9', 'Маруся Чурай', 1, 1979, 'Історичний роман', 8, 8),
('978-966-508-651-7', 'Дорога болю', 2, 1990, 'Поезія', 6, 6),
('978-617-679-434-5', 'Польові дослідження українського сексу', 3, 1996, 'Проза', 4, 4),
('978-966-03-7968-1', 'Захар Беркут', 4, 1883, 'Історична повість', 5, 5),
('978-966-03-7988-9', 'Кобзар', 5, 1840, 'Поезія', 10, 10),
('978-966-03-7101-2', 'Лісова пісня', 6, 1911, 'Драма-феєрія', 7, 7),
('978-966-03-7655-0', 'Байки Харківські', 7, 1769, 'Філософія', 3, 3),
('978-617-585-032-1', 'Рекреації', 8, 1992, 'Постмодернізм', 5, 5),
('978-617-585-033-8', 'Ворошиловград', 9, 2010, 'Сучасна проза', 6, 6),
('978-966-03-7520-1', 'Інститутка', 10, 1859, 'Реалізм', 4, 4);

--Таблиця читачів
INSERT INTO readers (first_name, last_name, email, phone, library_card_number)
VALUES
('Віктор', 'Кравчук', 'viktor@library.com', '+380962223344', 'LIB-001'),
('Наталія', 'Гончар', 'nataliya@library.com', '+380673334455', 'LIB-002'),
('Марія', 'Коваль', 'maria@library.com', '+380503336677', 'LIB-003'),
('Олександр', 'Семенюк', 'olex@library.com', '+380663331122', 'LIB-004'),
('Ірина', 'Ткаченко', 'iryna@library.com', '+380951112233', 'LIB-005'),
('Юрій', 'Мельник', 'yuriy@library.com', '+380931234567', 'LIB-006'),
('Світлана', 'Петренко', 'svitlana@library.com', '+380994445566', 'LIB-007'),
('Микола', 'Бондар', 'mykola@library.com', '+380675551212', 'LIB-008'),
('Олена', 'Литвин', 'olena@library.com', '+380685551717', 'LIB-009'),
('Петро', 'Кириленко', 'petro@library.com', '+380935551010', 'LIB-010');

SELECT 'Успішно додано 10 авторів, 10 книг і 10 читачів.' AS Status;